
import streamlit as st
import streamlit as st
from PIL import Image

from streamlit_cookies_controller import CookieController
from streamlit_authenticator import Authenticate
import streamlit_authenticator as stauth
from src.data_manager.client_data_manager import ClientDataManager


def landing_page():

    st.header("")

    with st.container():
        cols = st.columns((1, 1))
        with cols[0]:
            st.write(
                f"""

На нашому сайті знайомств ми робимо все можливе, щоб забезпечити вам найкращий досвід у пошуку ідеального партнера. Наша компанія пропонує унікальний підхід до знайомств, який базується на ретельному аналізі вашої особистості та вподобань.

Першим кроком на нашому сайті є заповнення докладної анкети, де ви маєте змогу розкрити свої інтереси, хобі, уподобання та очікування від майбутнього партнера. Ми віримо, що детальне знання один про одного допомагає знайти справжню гармонію.

Наша платформа прагне забезпечити надійність і безпеку усім користувачам. Ми використовуємо передові технології для захисту ваших особистих даних і забезпечення конфіденційності.

Крім того, ми пропонуємо широкий вибір функцій, які сприяють ефективному спілкуванню та взаєморозумінню між користувачами. Ви можете користуватися чатом, відеозв'язком, а також функцією відслідковування сумісності, щоб знайти того, хто відповідає вашим очікуванням найкраще.

Наш сайт знайомств прагне стати вашим надійним помічником у пошуку кохання і щастя. Долучайтеся до нашої спільноти сьогодні і відкрийте нові можливості для особистого щастя!

Наша бізнес модель полягає у тому, щоб утримувати вас тут максимально довго. Тож знайдете ви свого партнера хіба що у своїх мріях.
""",
                unsafe_allow_html=True
            )
